uploads/xml/Travelport-Request-6524b354c54ae-2286.xml

<?xml version="1.0"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Header/>
  <soapenv:Body>
    <air:LowFareSearchReq xmlns:air="http://www.travelport.com/schema/air_v51_0" xmlns:com="http://www.travelport.com/schema/common_v51_0" SolutionResult="false" TargetBranch="P3763969" TraceId="f3dddfc5e0044efe282e331284d43d54">
      <com:BillingPointOfSaleInfo OriginApplication="UAPI"/>
      <air:SearchAirLeg>
        <air:SearchOrigin>
          <com:CityOrAirport Code="AZZ"/>
        </air:SearchOrigin>
        <air:SearchDestination>
          <com:CityOrAirport Code="JFK"/>
        </air:SearchDestination>
        <air:SearchDepTime PreferredTime="2023-10-14"/>
        <air:AirLegModifiers>
          <air:PermittedCabins>
            <com:CabinClass Type="Economy"/>
          </air:PermittedCabins>
        </air:AirLegModifiers>
      </air:SearchAirLeg>
      <air:SearchAirLeg>
        <air:SearchOrigin>
          <com:CityOrAirport Code="JFK"/>
        </air:SearchOrigin>
        <air:SearchDestination>
          <com:CityOrAirport Code="AZZ"/>
        </air:SearchDestination>
        <air:SearchDepTime PreferredTime="2023-10-24"/>
        <air:AirLegModifiers>
          <air:PermittedCabins>
            <com:CabinClass Type="Economy"/>
          </air:PermittedCabins>
        </air:AirLegModifiers>
      </air:SearchAirLeg>
      <air:AirSearchModifiers>
        <air:PreferredProviders>
          <com:Provider Code="1G"/>
        </air:PreferredProviders>
        <air:FlightType NonStopDirects="true"/>
      </air:AirSearchModifiers>
      <com:SearchPassenger Code="ADT" Age="30"/>
      <air:AirPricingModifiers CurrencyType="SAR"/>
    </air:LowFareSearchReq>
  </soapenv:Body>
</soapenv:Envelope>
